array = ["Δημήτρης", "Ευγενία", "Ναταλία", "Ρένια", "Αλέξανδρος"]
print("Πίνακας:", array)

# Εφαρμογή του αλγορίθμου ταξινόμησης με εισαγωγή
for i in range(1, len(array)):
    value = array[i]  # Κρατάμε την τρέχουσα τιμή που θα εισαχθεί στο ταξινομημένο μέρος
    j = i
    while j > 0 and array[j - 1] > value:
        array[j] = array[j - 1]  # Μετακινούμε τα στοιχεία μία θέση δεξιά αν είναι μεγαλύτερα
        j = j - 1
    array[j] = value  # Τοποθετούμε την αποθηκευμένη τιμή στη σωστή θέση
    print(i, "η :", array)  # Εμφανίζουμε την εξέλιξη του πίνακα κατά τη διάρκεια της ταξινόμησης

print("Ο ταξινομημένος πίνακας:", array)
